Aplikasi/app/Models/UserModel.php

    public function getUserByUsername($username)
    {
        return $this->where('username', $username)->first();
---
SELECT *
FROM `tb_user`
WHERE `username` = 'Titan'
 LIMIT 1